[
  {
    "id": "introduccion-react",
    "titulo": "Introducción a React",
    "resumen": "Descubre los fundamentos de React y cómo empezar a crear interfaces modernas.",
    "autor": "Laura Gómez",
    "fecha": "2024-02-01",
    "contenido": [
      "React es una biblioteca de JavaScript enfocada en la construcción de interfaces de usuario. Fue creada por Facebook y su adopción ha crecido gracias a su enfoque declarativo y orientado a componentes.",
      "En esta guía exploramos los conceptos de componentes, props y estado, acompañados de ejemplos sencillos para que puedas iniciar tu propio proyecto con confianza.",
      "También revisamos el ecosistema que rodea a React y cómo herramientas como Vite, Tailwind CSS y Flowbite pueden ayudarte a crear experiencias ricas y eficientes."
    ],
    "etiquetas": ["React", "Frontend", "JavaScript"],
    "tags": ["react", "frontend", "javascript"],
    "imagen": "https://images.unsplash.com/photo-1523475472560-d2df97ec485c?auto=format&fit=crop&w=1200&q=80",
    "imagenAlt": "Código de React en una pantalla con iluminación tenue"
  },
  {
    "id": "diseno-con-tailwind",
    "titulo": "Diseño eficiente con Tailwind CSS",
    "resumen": "Aprende a crear interfaces responsivas y consistentes utilizando utilidades de Tailwind.",
    "autor": "Carlos Pérez",
    "fecha": "2024-02-15",
    "contenido": [
      "Tailwind CSS propone un enfoque basado en utilidades que permite construir interfaces complejas con clases predefinidas.",
      "Veremos cómo personalizar la configuración, reutilizar patrones de diseño y mantener un estilo coherente en tu proyecto.",
      "Para complementar, utilizamos componentes de Flowbite que aceleran el desarrollo y ofrecen una base visual bien definida."
    ],
    "etiquetas": ["Tailwind", "Diseño", "Productividad"],
    "tags": ["tailwind", "diseno", "productividad"],
    "imagen": "https://images.unsplash.com/photo-1523475472560-5a6bc78c15a0?auto=format&fit=crop&w=1200&q=80",
    "imagenAlt": "Persona diseñando componentes en un tablero con notas adhesivas"
  },
  {
    "id": "navegacion-con-react-router",
    "titulo": "Navegación moderna con React Router",
    "resumen": "Gestiona rutas dinámicas, parámetros y vistas anidadas con React Router DOM.",
    "autor": "Ana Martínez",
    "fecha": "2024-02-22",
    "contenido": [
      "React Router DOM se ha convertido en el estándar para manejar la navegación en aplicaciones de React.",
      "En este artículo cubrimos la configuración básica, el uso de parámetros de ruta y la integración con componentes de terceros.",
      "Aprenderás a crear experiencias fluidas para tus usuarios, incluyendo navegación programática y enlaces accesibles."
    ],
    "etiquetas": ["React Router", "Routing", "Buenas prácticas"],
    "tags": ["react-router", "routing", "buenas-practicas"],
    "imagen": "https://images.unsplash.com/photo-1516321497487-e288fb19713f?auto=format&fit=crop&w=1200&q=80",
    "imagenAlt": "Panel de control con múltiples caminos iluminados"
  }
]
